app/controllers/cart_controller.rb

SELECT * FROM `cart_items` WHERE (`cart_items`.`cart_id` = 43868) ORDER BY id
SELECT * FROM `orders` WHERE (`orders`.cart_id = 43868) LIMIT 1
---
  def find_cart_items
    # @cart_items = current_cart.cart_items
    @cart_items = CartItem.find(:all, :conditions => { :cart_id => current_cart }, :include => { :product => :images }, :order => "id")