app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`url` = '/stylesheets/offer.css') LIMIT 1
---
  def page
    @url = "/" + params[:path].join('/')
    @page = Page.find(:first, :conditions => { :url => @url })