app/controllers/products_controller.rb

SELECT * FROM `cart_items` WHERE (`cart_items`.cart_id = 43868 AND (`cart_items`.`product_id` = 2518)) LIMIT 1
---
  def add_to_cart
    begin
      item = Product::Item.find(params[:id])